<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"4dd038f231dc26aba46cc755ac4bf5ce2b180f06aa579044c36fd19c34540358","plan_job_ref":"Job Test actions using target and replace #484 at https://github.com/dflook/terraform-github-actions/actions/runs/14501055003","plan_out_hash":"94cd401438f265b8d64501b3323d0fd19261d72e207da0f88280968192d400aa","plan_hash":"e1b9fa134a196c62776adbdb3dcf128dbacb38abdac367afeed5de617f401b76","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "yS8hraNjGC" -> (known after apply)
!~  foreach = "86LtIFIjfX" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #484](https://github.com/dflook/terraform-github-actions/actions/runs/14501055003)